app/controllers/store_controller.rb

  def index
    @products = Product.find_products_for_sale
---
SELECT * FROM "products" ORDER BY title

  def add_to_cart
    session[:counter] = 0
    product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 6)